#include <iostream> 
#include <cstdlib> // Библиотека рандомизации чисел
#include <ctime> // Вспомогательная библиотека для рандомизации чисел
#include <string>
#include "array_utils.h" // Подключаем заголовочный файл модуля

using namespace std;

int main() {
    srand(time(0)); // Инициализация генератора случайных чисел

    // Запускаем все тесты на вычисление произведения
    array_utils::testCalculateProduct();

    // Размер массива, вводимый пользователем
    int size;
    cout << "Введите размер массива: ";
    cin >> size; // Пользователь вводит размер массива

    // Проверка на корректность введённого размера массива
    if (size <= 0) {
        cout << "Размер массива должен быть положительным числом!" << endl;
        return 1;
    }

    // Ввод минимального и максимального значений
    double min, max;
    cout << "Введите минимальное значение: ";
    cin >> min;
    cout << "Введите максимальное значение: ";
    cin >> max;

    // Проверка, чтобы максимальное значение было больше минимального
    if (min >= max) {
        cout << "Минимальное значение должно быть меньше максимального!" << endl;
        return 1;
    }

    double* arr = new double[size]; // Выделяем память под массив

    // Заполняем массив случайными числами
    // Передаем аргументы - изначальный массив, размер, мин.знач, макс.знач
    array_utils::fillArray(arr, size, min, max);

    // Выводим массив
    // В функцию передаем аргументы - изнчальный массив, размер
    cout << "Массив элементов:" << endl;
    array_utils::printArray(arr, size);

    // Записываем массив в файл
    // В функцию передаем аргументы - изначальный массив, размер, имя файла для записи
    string filename = "array_data.txt";
    array_utils::writeArrayToFile(arr, size, filename);

    // Выделяем память под новый массив для чтения данных из файла
    double* arrFromFile = new double[size];

    // Загружаем массив из файла
    // В функцию передаем аргументы - массив из файла, размер, имя файла для записи
    array_utils::readArrayFromFile(arrFromFile, size, filename);

    // Выводим массив из файла
    // В функцию передаем аргументы - массив из файла, размер
    cout << "Массив, загруженный из файла:" << endl;
    array_utils::printArray(arrFromFile, size);

    // Вычисляем произведение элементов массива
    // В функцию передаем аргументы - массив из файла, размер
    double product = array_utils::calculateProduct(arrFromFile, size);
    cout << "Произведение элементов массива: " << product << endl;

    // Освобождаем память от обоих массивов
    delete[] arr;
    delete[] arrFromFile;
    return 0;
}
